app/Models/ModelBuilder.php

SELECT `products`.`id`, `products`.`product_name`, `product_details`.`image`, `product_details`.`slug`
FROM `products`
JOIN `product_details` ON `products`.`id` = `product_details`.`id_product`
---
    public function joinData()
    {
            $builder = $this->db->table("products");
            $builder->select('products.id, products.product_name, product_details.image, product_details.slug');
            $builder->join('product_details','products.id = product_details.id_product');
            $query = $builder->get()->getResult();

SELECT *
FROM `products`
JOIN `product_details` ON `products`.`id` = `product_details`.`id_product`
JOIN `product_categories` ON `products`.`category_id` = `product_categories`.`id`
WHERE `product_details`.`slug` = 'f11guc'
---
    public function getDetail($slug) {
        $builder = $this->db->table("products");
        $builder->select("*");
        $builder->join("product_details", "products.id = product_details.id_product");
        $builder->where("product_details.slug", $slug);
        $detail = $builder->get()->getResult();